tutorials/Matyas/channelCaseConstructor2D/10_baseCasePimple/0.org/TSolid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TSolid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

//~internalField   uniform 873;
internalField   uniform 500.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        //~ value           $internalField; // 34.6 degC
        //~value           uniform 873.0;
        value           uniform 500.0;
    }
    
    
    "(outlet|walls|inletCyl|cylinder)"
    //~ {
        //~ type            fixedValue;
        //~ value           $internalField; // 115 degC
    //~ }
    {
        type            zeroGradient;
    }

    "(symmetry).*"
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            empty;
    }
}
