tutorials/Matyas/channelCaseConstructor2D/10_baseCasePimple/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 |                                                   
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox             
   \\    /   O peration     | Website:  https://openfoam.org                    
    \\  /    A nd           | Version:  10                                      
     \\/     M anipulation  |                                                   
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 1.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1; 

vertices 
( 
	 (0.0 0.0 0.0)	// 000
	 (8e-05 0.0 0.0)	// 001
	 (8e-05 0.000524 0.0)	// 002
	 (0.0 0.000524 0.0)	// 003
	 (0.0 0.0 0.001)	// 004
	 (8e-05 0.0 0.001)	// 005
	 (8e-05 0.000524 0.001)	// 006
	 (0.0 0.000524 0.001)	// 007
	 (0.0 0.000524 0.0)	// 008
	 (8e-05 0.000524 0.0)	// 009
	 (8e-05 0.000565 0.0)	// 010
	 (0.0 0.000565 0.0)	// 011
	 (0.0 0.000524 0.001)	// 012
	 (8e-05 0.000524 0.001)	// 013
	 (8e-05 0.000565 0.001)	// 014
	 (0.0 0.000565 0.001)	// 015
	 (0.0 0.000565 0.0)	// 016
	 (8e-05 0.000565 0.0)	// 017
	 (8e-05 0.000702 0.0)	// 018
	 (0.0 0.000702 0.0)	// 019
	 (0.0 0.000565 0.001)	// 020
	 (8e-05 0.000565 0.001)	// 021
	 (8e-05 0.000702 0.001)	// 022
	 (0.0 0.000702 0.001)	// 023
	 (0.0 0.000702 0.0)	// 024
	 (8e-05 0.000702 0.0)	// 025
	 (8e-05 0.000743 0.0)	// 026
	 (0.0 0.000743 0.0)	// 027
	 (0.0 0.000702 0.001)	// 028
	 (8e-05 0.000702 0.001)	// 029
	 (8e-05 0.000743 0.001)	// 030
	 (0.0 0.000743 0.001)	// 031
	 (0.0 0.000743 0.0)	// 032
	 (8e-05 0.000743 0.0)	// 033
	 (8e-05 0.001267 0.0)	// 034
	 (0.0 0.001267 0.0)	// 035
	 (0.0 0.000743 0.001)	// 036
	 (8e-05 0.000743 0.001)	// 037
	 (8e-05 0.001267 0.001)	// 038
	 (0.0 0.001267 0.001)	// 039
	 (0.0 0.001267 0.0)	// 040
	 (8e-05 0.001267 0.0)	// 041
	 (8e-05 0.001791 0.0)	// 042
	 (0.0 0.001791 0.0)	// 043
	 (0.0 0.001267 0.001)	// 044
	 (8e-05 0.001267 0.001)	// 045
	 (8e-05 0.001791 0.001)	// 046
	 (0.0 0.001791 0.001)	// 047
	 (0.0 0.001791 0.0)	// 048
	 (8e-05 0.001791 0.0)	// 049
	 (8e-05 0.001832 0.0)	// 050
	 (0.0 0.001832 0.0)	// 051
	 (0.0 0.001791 0.001)	// 052
	 (8e-05 0.001791 0.001)	// 053
	 (8e-05 0.001832 0.001)	// 054
	 (0.0 0.001832 0.001)	// 055
	 (0.0 0.001832 0.0)	// 056
	 (8e-05 0.001832 0.0)	// 057
	 (8e-05 0.001969 0.0)	// 058
	 (0.0 0.001969 0.0)	// 059
	 (0.0 0.001832 0.001)	// 060
	 (8e-05 0.001832 0.001)	// 061
	 (8e-05 0.001969 0.001)	// 062
	 (0.0 0.001969 0.001)	// 063
	 (0.0 0.001969 0.0)	// 064
	 (8e-05 0.001969 0.0)	// 065
	 (8e-05 0.00201 0.0)	// 066
	 (0.0 0.00201 0.0)	// 067
	 (0.0 0.001969 0.001)	// 068
	 (8e-05 0.001969 0.001)	// 069
	 (8e-05 0.00201 0.001)	// 070
	 (0.0 0.00201 0.001)	// 071
	 (0.0 0.00201 0.0)	// 072
	 (8e-05 0.00201 0.0)	// 073
	 (8e-05 0.002534 0.0)	// 074
	 (0.0 0.002534 0.0)	// 075
	 (0.0 0.00201 0.001)	// 076
	 (8e-05 0.00201 0.001)	// 077
	 (8e-05 0.002534 0.001)	// 078
	 (0.0 0.002534 0.001)	// 079
	 (0.0 0.000524 0.001)	// 080
	 (8e-05 0.000524 0.001)	// 081
	 (8e-05 0.000565 0.001)	// 082
	 (0.0 0.000565 0.001)	// 083
	 (0.0 0.000524 0.002)	// 084
	 (8e-05 0.000524 0.002)	// 085
	 (8e-05 0.000565 0.002)	// 086
	 (0.0 0.000565 0.002)	// 087
	 (0.0 0.000565 0.001)	// 088
	 (8e-05 0.000565 0.001)	// 089
	 (8e-05 0.000702 0.001)	// 090
	 (0.0 0.000702 0.001)	// 091
	 (0.0 0.000565 0.002)	// 092
	 (8e-05 0.000565 0.002)	// 093
	 (8e-05 0.000702 0.002)	// 094
	 (0.0 0.000702 0.002)	// 095
	 (0.0 0.000702 0.001)	// 096
	 (8e-05 0.000702 0.001)	// 097
	 (8e-05 0.000743 0.001)	// 098
	 (0.0 0.000743 0.001)	// 099
	 (0.0 0.000702 0.002)	// 100
	 (8e-05 0.000702 0.002)	// 101
	 (8e-05 0.000743 0.002)	// 102
	 (0.0 0.000743 0.002)	// 103
	 (0.0 0.000743 0.001)	// 104
	 (8e-05 0.000743 0.001)	// 105
	 (8e-05 0.001267 0.001)	// 106
	 (0.0 0.001267 0.001)	// 107
	 (0.0 0.000743 0.002)	// 108
	 (8e-05 0.000743 0.002)	// 109
	 (8e-05 0.001267 0.002)	// 110
	 (0.0 0.001267 0.002)	// 111
	 (0.0 0.001267 0.001)	// 112
	 (8e-05 0.001267 0.001)	// 113
	 (8e-05 0.001791 0.001)	// 114
	 (0.0 0.001791 0.001)	// 115
	 (0.0 0.001267 0.002)	// 116
	 (8e-05 0.001267 0.002)	// 117
	 (8e-05 0.001791 0.002)	// 118
	 (0.0 0.001791 0.002)	// 119
	 (0.0 0.001791 0.001)	// 120
	 (8e-05 0.001791 0.001)	// 121
	 (8e-05 0.001832 0.001)	// 122
	 (0.0 0.001832 0.001)	// 123
	 (0.0 0.001791 0.002)	// 124
	 (8e-05 0.001791 0.002)	// 125
	 (8e-05 0.001832 0.002)	// 126
	 (0.0 0.001832 0.002)	// 127
	 (0.0 0.001832 0.001)	// 128
	 (8e-05 0.001832 0.001)	// 129
	 (8e-05 0.001969 0.001)	// 130
	 (0.0 0.001969 0.001)	// 131
	 (0.0 0.001832 0.002)	// 132
	 (8e-05 0.001832 0.002)	// 133
	 (8e-05 0.001969 0.002)	// 134
	 (0.0 0.001969 0.002)	// 135
	 (0.0 0.001969 0.001)	// 136
	 (8e-05 0.001969 0.001)	// 137
	 (8e-05 0.00201 0.001)	// 138
	 (0.0 0.00201 0.001)	// 139
	 (0.0 0.001969 0.002)	// 140
	 (8e-05 0.001969 0.002)	// 141
	 (8e-05 0.00201 0.002)	// 142
	 (0.0 0.00201 0.002)	// 143
	 (0.0 0.0 0.002)	// 144
	 (8e-05 0.0 0.002)	// 145
	 (8e-05 0.000524 0.002)	// 146
	 (0.0 0.000524 0.002)	// 147
	 (0.0 0.0 0.01)	// 148
	 (8e-05 0.0 0.01)	// 149
	 (8e-05 0.000524 0.01)	// 150
	 (0.0 0.000524 0.01)	// 151
	 (0.0 0.000524 0.002)	// 152
	 (8e-05 0.000524 0.002)	// 153
	 (8e-05 0.000565 0.002)	// 154
	 (0.0 0.000565 0.002)	// 155
	 (0.0 0.000524 0.01)	// 156
	 (8e-05 0.000524 0.01)	// 157
	 (8e-05 0.000565 0.01)	// 158
	 (0.0 0.000565 0.01)	// 159
	 (0.0 0.000565 0.002)	// 160
	 (8e-05 0.000565 0.002)	// 161
	 (8e-05 0.000702 0.002)	// 162
	 (0.0 0.000702 0.002)	// 163
	 (0.0 0.000565 0.01)	// 164
	 (8e-05 0.000565 0.01)	// 165
	 (8e-05 0.000702 0.01)	// 166
	 (0.0 0.000702 0.01)	// 167
	 (0.0 0.000702 0.002)	// 168
	 (8e-05 0.000702 0.002)	// 169
	 (8e-05 0.000743 0.002)	// 170
	 (0.0 0.000743 0.002)	// 171
	 (0.0 0.000702 0.01)	// 172
	 (8e-05 0.000702 0.01)	// 173
	 (8e-05 0.000743 0.01)	// 174
	 (0.0 0.000743 0.01)	// 175
	 (0.0 0.000743 0.002)	// 176
	 (8e-05 0.000743 0.002)	// 177
	 (8e-05 0.001267 0.002)	// 178
	 (0.0 0.001267 0.002)	// 179
	 (0.0 0.000743 0.01)	// 180
	 (8e-05 0.000743 0.01)	// 181
	 (8e-05 0.001267 0.01)	// 182
	 (0.0 0.001267 0.01)	// 183
	 (0.0 0.001267 0.002)	// 184
	 (8e-05 0.001267 0.002)	// 185
	 (8e-05 0.001791 0.002)	// 186
	 (0.0 0.001791 0.002)	// 187
	 (0.0 0.001267 0.01)	// 188
	 (8e-05 0.001267 0.01)	// 189
	 (8e-05 0.001791 0.01)	// 190
	 (0.0 0.001791 0.01)	// 191
	 (0.0 0.001791 0.002)	// 192
	 (8e-05 0.001791 0.002)	// 193
	 (8e-05 0.001832 0.002)	// 194
	 (0.0 0.001832 0.002)	// 195
	 (0.0 0.001791 0.01)	// 196
	 (8e-05 0.001791 0.01)	// 197
	 (8e-05 0.001832 0.01)	// 198
	 (0.0 0.001832 0.01)	// 199
	 (0.0 0.001832 0.002)	// 200
	 (8e-05 0.001832 0.002)	// 201
	 (8e-05 0.001969 0.002)	// 202
	 (0.0 0.001969 0.002)	// 203
	 (0.0 0.001832 0.01)	// 204
	 (8e-05 0.001832 0.01)	// 205
	 (8e-05 0.001969 0.01)	// 206
	 (0.0 0.001969 0.01)	// 207
	 (0.0 0.001969 0.002)	// 208
	 (8e-05 0.001969 0.002)	// 209
	 (8e-05 0.00201 0.002)	// 210
	 (0.0 0.00201 0.002)	// 211
	 (0.0 0.001969 0.01)	// 212
	 (8e-05 0.001969 0.01)	// 213
	 (8e-05 0.00201 0.01)	// 214
	 (0.0 0.00201 0.01)	// 215
	 (0.0 0.00201 0.002)	// 216
	 (8e-05 0.00201 0.002)	// 217
	 (8e-05 0.002534 0.002)	// 218
	 (0.0 0.002534 0.002)	// 219
	 (0.0 0.00201 0.01)	// 220
	 (8e-05 0.00201 0.01)	// 221
	 (8e-05 0.002534 0.01)	// 222
	 (0.0 0.002534 0.01)	// 223
	 (0.0 0.0 0.01)	// 224
	 (8e-05 0.0 0.01)	// 225
	 (8e-05 0.000524 0.01)	// 226
	 (0.0 0.000524 0.01)	// 227
	 (0.0 0.0 0.011)	// 228
	 (8e-05 0.0 0.011)	// 229
	 (8e-05 0.000524 0.011)	// 230
	 (0.0 0.000524 0.011)	// 231
	 (0.0 0.000524 0.01)	// 232
	 (8e-05 0.000524 0.01)	// 233
	 (8e-05 0.000565 0.01)	// 234
	 (0.0 0.000565 0.01)	// 235
	 (0.0 0.000524 0.011)	// 236
	 (8e-05 0.000524 0.011)	// 237
	 (8e-05 0.000565 0.011)	// 238
	 (0.0 0.000565 0.011)	// 239
	 (0.0 0.000565 0.01)	// 240
	 (8e-05 0.000565 0.01)	// 241
	 (8e-05 0.000702 0.01)	// 242
	 (0.0 0.000702 0.01)	// 243
	 (0.0 0.000565 0.011)	// 244
	 (8e-05 0.000565 0.011)	// 245
	 (8e-05 0.000702 0.011)	// 246
	 (0.0 0.000702 0.011)	// 247
	 (0.0 0.000702 0.01)	// 248
	 (8e-05 0.000702 0.01)	// 249
	 (8e-05 0.000743 0.01)	// 250
	 (0.0 0.000743 0.01)	// 251
	 (0.0 0.000702 0.011)	// 252
	 (8e-05 0.000702 0.011)	// 253
	 (8e-05 0.000743 0.011)	// 254
	 (0.0 0.000743 0.011)	// 255
	 (0.0 0.001791 0.01)	// 256
	 (8e-05 0.001791 0.01)	// 257
	 (8e-05 0.001832 0.01)	// 258
	 (0.0 0.001832 0.01)	// 259
	 (0.0 0.001791 0.011)	// 260
	 (8e-05 0.001791 0.011)	// 261
	 (8e-05 0.001832 0.011)	// 262
	 (0.0 0.001832 0.011)	// 263
	 (0.0 0.001832 0.01)	// 264
	 (8e-05 0.001832 0.01)	// 265
	 (8e-05 0.001969 0.01)	// 266
	 (0.0 0.001969 0.01)	// 267
	 (0.0 0.001832 0.011)	// 268
	 (8e-05 0.001832 0.011)	// 269
	 (8e-05 0.001969 0.011)	// 270
	 (0.0 0.001969 0.011)	// 271
	 (0.0 0.001969 0.01)	// 272
	 (8e-05 0.001969 0.01)	// 273
	 (8e-05 0.00201 0.01)	// 274
	 (0.0 0.00201 0.01)	// 275
	 (0.0 0.001969 0.011)	// 276
	 (8e-05 0.001969 0.011)	// 277
	 (8e-05 0.00201 0.011)	// 278
	 (0.0 0.00201 0.011)	// 279
	 (0.0 0.00201 0.01)	// 280
	 (8e-05 0.00201 0.01)	// 281
	 (8e-05 0.002534 0.01)	// 282
	 (0.0 0.002534 0.01)	// 283
	 (0.0 0.00201 0.011)	// 284
	 (8e-05 0.00201 0.011)	// 285
	 (8e-05 0.002534 0.011)	// 286
	 (0.0 0.002534 0.011)	// 287
	 (0.0 0.0 0.011)	// 288
	 (8e-05 0.0 0.011)	// 289
	 (8e-05 0.000524 0.011)	// 290
	 (0.0 0.000524 0.011)	// 291
	 (0.0 0.0 0.031)	// 292
	 (8e-05 0.0 0.031)	// 293
	 (8e-05 0.000524 0.031)	// 294
	 (0.0 0.000524 0.031)	// 295
	 (0.0 0.000524 0.011)	// 296
	 (8e-05 0.000524 0.011)	// 297
	 (8e-05 0.000565 0.011)	// 298
	 (0.0 0.000565 0.011)	// 299
	 (0.0 0.000524 0.031)	// 300
	 (8e-05 0.000524 0.031)	// 301
	 (8e-05 0.000565 0.031)	// 302
	 (0.0 0.000565 0.031)	// 303
	 (0.0 0.000565 0.011)	// 304
	 (8e-05 0.000565 0.011)	// 305
	 (8e-05 0.000702 0.011)	// 306
	 (0.0 0.000702 0.011)	// 307
	 (0.0 0.000565 0.031)	// 308
	 (8e-05 0.000565 0.031)	// 309
	 (8e-05 0.000702 0.031)	// 310
	 (0.0 0.000702 0.031)	// 311
	 (0.0 0.000702 0.011)	// 312
	 (8e-05 0.000702 0.011)	// 313
	 (8e-05 0.000743 0.011)	// 314
	 (0.0 0.000743 0.011)	// 315
	 (0.0 0.000702 0.031)	// 316
	 (8e-05 0.000702 0.031)	// 317
	 (8e-05 0.000743 0.031)	// 318
	 (0.0 0.000743 0.031)	// 319
	 (0.0 0.000743 0.011)	// 320
	 (8e-05 0.000743 0.011)	// 321
	 (8e-05 0.001267 0.011)	// 322
	 (0.0 0.001267 0.011)	// 323
	 (0.0 0.000743 0.031)	// 324
	 (8e-05 0.000743 0.031)	// 325
	 (8e-05 0.001267 0.031)	// 326
	 (0.0 0.001267 0.031)	// 327
	 (0.0 0.001267 0.011)	// 328
	 (8e-05 0.001267 0.011)	// 329
	 (8e-05 0.001791 0.011)	// 330
	 (0.0 0.001791 0.011)	// 331
	 (0.0 0.001267 0.031)	// 332
	 (8e-05 0.001267 0.031)	// 333
	 (8e-05 0.001791 0.031)	// 334
	 (0.0 0.001791 0.031)	// 335
	 (0.0 0.001791 0.011)	// 336
	 (8e-05 0.001791 0.011)	// 337
	 (8e-05 0.001832 0.011)	// 338
	 (0.0 0.001832 0.011)	// 339
	 (0.0 0.001791 0.031)	// 340
	 (8e-05 0.001791 0.031)	// 341
	 (8e-05 0.001832 0.031)	// 342
	 (0.0 0.001832 0.031)	// 343
	 (0.0 0.001832 0.011)	// 344
	 (8e-05 0.001832 0.011)	// 345
	 (8e-05 0.001969 0.011)	// 346
	 (0.0 0.001969 0.011)	// 347
	 (0.0 0.001832 0.031)	// 348
	 (8e-05 0.001832 0.031)	// 349
	 (8e-05 0.001969 0.031)	// 350
	 (0.0 0.001969 0.031)	// 351
	 (0.0 0.001969 0.011)	// 352
	 (8e-05 0.001969 0.011)	// 353
	 (8e-05 0.00201 0.011)	// 354
	 (0.0 0.00201 0.011)	// 355
	 (0.0 0.001969 0.031)	// 356
	 (8e-05 0.001969 0.031)	// 357
	 (8e-05 0.00201 0.031)	// 358
	 (0.0 0.00201 0.031)	// 359
	 (0.0 0.00201 0.011)	// 360
	 (8e-05 0.00201 0.011)	// 361
	 (8e-05 0.002534 0.011)	// 362
	 (0.0 0.002534 0.011)	// 363
	 (0.0 0.00201 0.031)	// 364
	 (8e-05 0.00201 0.031)	// 365
	 (8e-05 0.002534 0.031)	// 366
	 (0.0 0.002534 0.031)	// 367
); 

edges 
( 

); 

blocks 
( 
	hex
		(0 1 2 3 4 5 6 7)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(8 9 10 11 12 13 14 15)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(16 17 18 19 20 21 22 23)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(24 25 26 27 28 29 30 31)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(32 33 34 35 36 37 38 39)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(40 41 42 43 44 45 46 47)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(48 49 50 51 52 53 54 55)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(56 57 58 59 60 61 62 63)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(64 65 66 67 68 69 70 71)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(72 73 74 75 76 77 78 79)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(80 81 82 83 84 85 86 87)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(88 89 90 91 92 93 94 95)	wall
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(96 97 98 99 100 101 102 103)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(104 105 106 107 108 109 110 111)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(112 113 114 115 116 117 118 119)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(120 121 122 123 124 125 126 127)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(128 129 130 131 132 133 134 135)	wall
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(136 137 138 139 140 141 142 143)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(144 145 146 147 148 149 150 151)
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(152 153 154 155 156 157 158 159)	coat
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(160 161 162 163 164 165 166 167)	wall
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(168 169 170 171 172 173 174 175)	coat
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(176 177 178 179 180 181 182 183)
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(184 185 186 187 188 189 190 191)
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(192 193 194 195 196 197 198 199)	coat
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(200 201 202 203 204 205 206 207)	wall
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(208 209 210 211 212 213 214 215)	coat
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(216 217 218 219 220 221 222 223)
		(1 6 66)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(224 225 226 227 228 229 230 231)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(232 233 234 235 236 237 238 239)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(240 241 242 243 244 245 246 247)	wall
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(248 249 250 251 252 253 254 255)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(256 257 258 259 260 261 262 263)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(264 265 266 267 268 269 270 271)	wall
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(272 273 274 275 276 277 278 279)	coat
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(280 281 282 283 284 285 286 287)
		(1 6 8)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(288 289 290 291 292 293 294 295)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(296 297 298 299 300 301 302 303)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(304 305 306 307 308 309 310 311)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(312 313 314 315 316 317 318 319)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(320 321 322 323 324 325 326 327)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(328 329 330 331 332 333 334 335)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(336 337 338 339 340 341 342 343)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(344 345 346 347 348 349 350 351)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(352 353 354 355 356 357 358 359)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

	hex
		(360 361 362 363 364 365 366 367)
		(1 6 166)	simpleGrading 	(1.000000 1.000000 1.000000)

); 

boundary 
( 
	emptyLeft
	{
		type empty;
		faces
		(
			(1 2 6 5)
			(9 10 14 13)
			(17 18 22 21)
			(25 26 30 29)
			(33 34 38 37)
			(41 42 46 45)
			(49 50 54 53)
			(57 58 62 61)
			(65 66 70 69)
			(73 74 78 77)
			(81 82 86 85)
			(89 90 94 93)
			(97 98 102 101)
			(105 106 110 109)
			(113 114 118 117)
			(121 122 126 125)
			(129 130 134 133)
			(137 138 142 141)
			(145 146 150 149)
			(153 154 158 157)
			(161 162 166 165)
			(169 170 174 173)
			(177 178 182 181)
			(185 186 190 189)
			(193 194 198 197)
			(201 202 206 205)
			(209 210 214 213)
			(217 218 222 221)
			(225 226 230 229)
			(233 234 238 237)
			(241 242 246 245)
			(249 250 254 253)
			(257 258 262 261)
			(265 266 270 269)
			(273 274 278 277)
			(281 282 286 285)
			(289 290 294 293)
			(297 298 302 301)
			(305 306 310 309)
			(313 314 318 317)
			(321 322 326 325)
			(329 330 334 333)
			(337 338 342 341)
			(345 346 350 349)
			(353 354 358 357)
			(361 362 366 365)
		);
	}

	emptyRight
	{
		type empty;
		faces
		(
			(0 3 7 4)
			(8 11 15 12)
			(16 19 23 20)
			(24 27 31 28)
			(32 35 39 36)
			(40 43 47 44)
			(48 51 55 52)
			(56 59 63 60)
			(64 67 71 68)
			(72 75 79 76)
			(80 83 87 84)
			(88 91 95 92)
			(96 99 103 100)
			(104 107 111 108)
			(112 115 119 116)
			(120 123 127 124)
			(128 131 135 132)
			(136 139 143 140)
			(144 147 151 148)
			(152 155 159 156)
			(160 163 167 164)
			(168 171 175 172)
			(176 179 183 180)
			(184 187 191 188)
			(192 195 199 196)
			(200 203 207 204)
			(208 211 215 212)
			(216 219 223 220)
			(224 227 231 228)
			(232 235 239 236)
			(240 243 247 244)
			(248 251 255 252)
			(256 259 263 260)
			(264 267 271 268)
			(272 275 279 276)
			(280 283 287 284)
			(288 291 295 292)
			(296 299 303 300)
			(304 307 311 308)
			(312 315 319 316)
			(320 323 327 324)
			(328 331 335 332)
			(336 339 343 340)
			(344 347 351 348)
			(352 355 359 356)
			(360 363 367 364)
		);
	}

	symmetryTop
	{
		type symmetryPlane;
		faces
		(
			(75 74 78 79)
			(219 218 222 223)
			(283 282 286 287)
			(363 362 366 367)
		);
	}

	symmetryBottom
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
			(144 145 149 148)
			(224 225 229 228)
			(288 289 293 292)
		);
	}

	walls
	{
		type wall;
		faces
		(
			(4 5 6 7)
			(76 77 78 79)
			(80 81 85 84)
			(144 145 146 147)
			(180 181 182 183)
			(188 189 190 191)
			(216 217 218 219)
			(256 257 261 260)
			(320 321 322 323)
			(328 329 330 331)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			(0 1 2 3)
			(8 9 10 11)
			(16 17 18 19)
			(24 25 26 27)
			(32 33 34 35)
			(40 41 42 43)
			(48 49 50 51)
			(56 57 58 59)
			(64 65 66 67)
			(72 73 74 75)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(292 293 294 295)
			(300 301 302 303)
			(308 309 310 311)
			(316 317 318 319)
			(324 325 326 327)
			(332 333 334 335)
			(340 341 342 343)
			(348 349 350 351)
			(356 357 358 359)
			(364 365 366 367)
		);
	}

	masterPerp
	{
		type patch;
		faces
		(
			(12 13 14 15)
			(20 21 22 23)
			(28 29 30 31)
			(36 37 38 39)
			(44 45 46 47)
			(52 53 54 55)
			(60 61 62 63)
			(68 69 70 71)
			(84 85 86 87)
			(92 93 94 95)
			(100 101 102 103)
			(108 109 110 111)
			(116 117 118 119)
			(124 125 126 127)
			(132 133 134 135)
			(140 141 142 143)
			(148 149 150 151)
			(156 157 158 159)
			(164 165 166 167)
			(172 173 174 175)
			(196 197 198 199)
			(204 205 206 207)
			(212 213 214 215)
			(220 221 222 223)
			(228 229 230 231)
			(236 237 238 239)
			(244 245 246 247)
			(252 253 254 255)
			(260 261 262 263)
			(268 269 270 271)
			(276 277 278 279)
			(284 285 286 287)
		);
	}

	slavePerp
	{
		type patch;
		faces
		(
			(80 81 82 83)
			(88 89 90 91)
			(96 97 98 99)
			(104 105 106 107)
			(112 113 114 115)
			(120 121 122 123)
			(128 129 130 131)
			(136 137 138 139)
			(152 153 154 155)
			(160 161 162 163)
			(168 169 170 171)
			(176 177 178 179)
			(184 185 186 187)
			(192 193 194 195)
			(200 201 202 203)
			(208 209 210 211)
			(224 225 226 227)
			(232 233 234 235)
			(240 241 242 243)
			(248 249 250 251)
			(256 257 258 259)
			(264 265 266 267)
			(272 273 274 275)
			(280 281 282 283)
			(288 289 290 291)
			(296 297 298 299)
			(304 305 306 307)
			(312 313 314 315)
			(336 337 338 339)
			(344 345 346 347)
			(352 353 354 355)
			(360 361 362 363)
		);
	}

	masterHor
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(11 10 14 15)
			(19 18 22 23)
			(27 26 30 31)
			(35 34 38 39)
			(43 42 46 47)
			(51 50 54 55)
			(59 58 62 63)
			(67 66 70 71)
			(83 82 86 87)
			(91 90 94 95)
			(99 98 102 103)
			(107 106 110 111)
			(115 114 118 119)
			(123 122 126 127)
			(131 130 134 135)
			(147 146 150 151)
			(155 154 158 159)
			(163 162 166 167)
			(171 170 174 175)
			(179 178 182 183)
			(187 186 190 191)
			(195 194 198 199)
			(203 202 206 207)
			(211 210 214 215)
			(227 226 230 231)
			(235 234 238 239)
			(243 242 246 247)
			(259 258 262 263)
			(267 266 270 271)
			(275 274 278 279)
			(291 290 294 295)
			(299 298 302 303)
			(307 306 310 311)
			(315 314 318 319)
			(323 322 326 327)
			(331 330 334 335)
			(339 338 342 343)
			(347 346 350 351)
			(355 354 358 359)
		);
	}

	slaveHor
	{
		type patch;
		faces
		(
			(8 9 13 12)
			(16 17 21 20)
			(24 25 29 28)
			(32 33 37 36)
			(40 41 45 44)
			(48 49 53 52)
			(56 57 61 60)
			(64 65 69 68)
			(72 73 77 76)
			(88 89 93 92)
			(96 97 101 100)
			(104 105 109 108)
			(112 113 117 116)
			(120 121 125 124)
			(128 129 133 132)
			(136 137 141 140)
			(152 153 157 156)
			(160 161 165 164)
			(168 169 173 172)
			(176 177 181 180)
			(184 185 189 188)
			(192 193 197 196)
			(200 201 205 204)
			(208 209 213 212)
			(216 217 221 220)
			(232 233 237 236)
			(240 241 245 244)
			(248 249 253 252)
			(264 265 269 268)
			(272 273 277 276)
			(280 281 285 284)
			(296 297 301 300)
			(304 305 309 308)
			(312 313 317 316)
			(320 321 325 324)
			(328 329 333 332)
			(336 337 341 340)
			(344 345 349 348)
			(352 353 357 356)
			(360 361 365 364)
		);
	}

	masterVer
	{
		type patch;
		faces
		(
		);
	}

	slaveVer
	{
		type patch;
		faces
		(
		);
	}

); 

mergePatchPairs 
( 
); 

// ************************************************************************* //

